app/controllers/locations_controller.rb

INSERT INTO "locations" ("title", "description", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Bean"], ["description", "it's actually called 'cloud gate'"], ["address", "Millennium park, chicago"], ["created_at", 2017-03-29 15:33:33 UTC], ["updated_at", 2017-03-29 15:33:33 UTC]]
---
  def create
    @location = Location.new(location_params)
    if @location.save

UPDATE "locations" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "locations"."id" = $5  [["address", "woodfield mall"], ["latitude", 42.0464163], ["longitude", -88.03712519999999], ["updated_at", 2017-03-29 21:55:13 UTC], ["id", 5]]
---
  def update
    if @location.update(location_params)

DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 13]]
---
  def destroy
    @location.destroy